---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthLessThan2TimesMinWidthFailure
source: html/f4173bce-0023-89e2-4be6-ea07bfe37939.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunWidthLessThan2TimesMinWidthFailure Property

The value for Minimum Width on Inside Boundary is too large to satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunWidthLessThan2TimesMinWidthFailure { get; }
```